app/views/trips/show.html.erb


<% if @trip.comments.empty? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."trip_id" = ? LIMIT 1  [[nil, 4]]