app/controllers/comments_controller.rb

 def create
 @trip = Trip.find params[:trip_id]
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 4]]