app/controllers/trips_controller.rb

INSERT INTO "trips" ("name", "rating", "people", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Asia"], ["rating", "5"], ["people", 100], ["created_at", "2016-10-12 14:46:06.048778"], ["updated_at", "2016-10-12 14:46:06.048778"]]
---
  def create
    @trip = Trip.new(trip_params)

    respond_to do |format|
      if @trip.save

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_trip
      @trip = Trip.find(params[:id])